c5/src/Documents/PickupOrder/PickupOrder.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>PickupOrder</name>
  <posting>Deny</posting>
  <attributes>
    <name>Action</name>
    <type>
      <types>EnumRef.Actions</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Required</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Warehouse</name>
    <type>
      <types>CatalogRef.Warehouses</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Items</name>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Picked</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Shipments</name>
    <attributes>
      <name>Capacity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>Feature</name>
      <type>
        <types>CatalogRef.Features</types>
      </type>
    </attributes>
    <attributes>
      <name>Item</name>
      <type>
        <types>CatalogRef.Items</types>
      </type>
    </attributes>
    <attributes>
      <name>Package</name>
      <type>
        <types>CatalogRef.Packages</types>
      </type>
    </attributes>
    <attributes>
      <name>Quantity</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkg</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgBack</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPkgPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityPlan</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RowKey</name>
      <type>
        <types>CatalogRef.RowKeys</types>
      </type>
    </attributes>
    <attributes>
      <name>Shipment</name>
      <type>
        <types>DocumentRef.Shipment</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

c5/src/Enums/ShipmentPoints/ShipmentPoints.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ShipmentPoints</name>
  <enumValues>
    <name>All</name>
  </enumValues>
  <enumValues>
    <name>Canceled</name>
  </enumValues>
  <enumValues>
    <name>Finish</name>
  </enumValues>
  <enumValues>
    <name>New</name>
  </enumValues>
  <enumValues>
    <name>Picking</name>
  </enumValues>
</mdclass:Enum>

c5/src/Enums/Actions/Actions.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Actions</name>
  <enumValues>
    <name>Approve</name>
  </enumValues>
  <enumValues>
    <name>CommitRejection</name>
  </enumValues>
  <enumValues>
    <name>CompleteApproval</name>
  </enumValues>
  <enumValues>
    <name>CompleteDelivery</name>
  </enumValues>
  <enumValues>
    <name>CompleteEdition</name>
  </enumValues>
  <enumValues>
    <name>CompleteInventory</name>
  </enumValues>
  <enumValues>
    <name>CompleteInvoicing</name>
  </enumValues>
  <enumValues>
    <name>CompletePicking</name>
  </enumValues>
  <enumValues>
    <name>CompleteShipment</name>
  </enumValues>
  <enumValues>
    <name>Post</name>
  </enumValues>
  <enumValues>
    <name>Complete</name>
  </enumValues>
  <enumValues>
    <name>Return</name>
  </enumValues>
  <enumValues>
    <name>Reject</name>
  </enumValues>
  <enumValues>
    <name>SendToApproval</name>
  </enumValues>
  <enumValues>
    <name>StartPicking</name>
  </enumValues>
  <enumValues>
    <name>Resolve</name>
  </enumValues>
  <enumValues>
    <name>Rework</name>
  </enumValues>
</mdclass:Enum>

c5/src/Documents/PickupOrder/Forms/Form/Module.bsl
&AtClient
var ItemsRow;
&AtClient
var ShipmentsRow;

// *****************************************
// *********** Form events

&AtServer
Procedure OnReadAtServer ( CurrentObject )
	
	readStatus ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readStatus ()
	
	Status = InformationRegisters.PickupOrderStatuses.Get ( new Structure ( "Document", Object.Ref ) ).Status;
	
EndProcedure 

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	if ( Object.Ref.IsEmpty () ) then
		Output.InteractiveCreationRestricted ();
		Cancel = true;
		return;
	endif; 
	setAccuracy ();
	Options.Company ( ThisObject, Object.Company );
	StandardButtons.Arrange ( ThisObject );
	readAppearance ();
	Appearance.Apply ( ThisObject );
	
EndProcedure

&AtServer
Procedure readAppearance ()

	rules = new Array ();
	rules.Add ( "
	|FormStart show Status = Enum.ShipmentPoints.New;
	|FormComplete show Status = Enum.ShipmentPoints.Picking;
	|FormWrite show Status <> Enum.ShipmentPoints.Finish;
	|ProcessCompleted show Status = Enum.ShipmentPoints.Finish;
	|MemoLabel show filled ( Object.Memo );
	|Items lock Status <> Enum.ShipmentPoints.Picking;
	|Memo lock Status = Enum.ShipmentPoints.Finish
	|" );
	Appearance.Read ( ThisObject, rules );

EndProcedure
	
&AtServer
Procedure setAccuracy ()
	
	Options.SetAccuracy ( ThisObject, "ItemsQuantity, ItemsQuantityPkg, ShipmentsQuantity, ShipmentsQuantityPkg" );
	Options.SetAccuracy ( ThisObject, "ItemsQuantityBack, ItemsQuantityPkgBack, ShipmentsQuantityBack, ShipmentsQuantityPkgBack", , false );
	Options.SetAccuracy ( ThisObject, "ItemsTotalQuantity, ItemsTotalQuantityPkg", false );
	
EndProcedure 

&AtServer
Procedure AfterWriteAtServer ( CurrentObject, WriteParameters )
	
	readStatus ();
	Appearance.Apply ( ThisObject, "Status" );
	
EndProcedure

&AtClient
Procedure AfterWrite ( WriteParameters )
	
	NotifyChanged ( Type ( "DocumentRef.Shipment" ) );
	
EndProcedure

&AtClient
Procedure NotificationProcessing ( EventName, Parameter, Source )
	
	if ( EventName = Enum.MessageBarcodeScanned ()
		and Source.FormOwner.UUID = ThisObject.UUID ) then
		setItem ( Parameter );
	endif; 
	
EndProcedure

&AtClient
Procedure setItem ( Fields )
	
	search = new Structure ( "Item, Package, Feature" );
	FillPropertyValues ( search, Fields );
	rows = Object.Items.FindRows ( search );
	if ( rows.Count () = 0 ) then
		Output.ItemNotFound ();
	else
		ItemsRow = rows [ 0 ];
		Items.Items.CurrentRow = ItemsRow.GetID ();
		ItemsRow.Picked = true;
		pickItem ();
	endif; 
	
EndProcedure 

&AtClient
Procedure pickItem ()
	
	ItemsRow.Quantity = ? ( ItemsRow.Picked, ItemsRow.QuantityPlan, 0 );
	Computations.Packages ( ItemsRow );
	calcQuantityBack ();
	applyQuantity ();
	
EndProcedure 

&AtClient
Procedure calcQuantityBack ()
	
	ItemsRow.QuantityBack = ItemsRow.QuantityPlan - ItemsRow.Quantity;
	ItemsRow.QuantityPkgBack = ItemsRow.QuantityBack / ItemsRow.Capacity;
	
EndProcedure 

&AtClient
Procedure applyQuantity ()
	
	search = new Structure ( "Item, Feature, Package" );
	for each row in Object.Items do
		quantity = row.Quantity;
		quantityPkg = row.QuantityPkg;
		FillPropertyValues ( search, row );
		rows = Object.Shipments.FindRows ( search );
		for each shipmentRow in rows do
			shipmentRow.Quantity = Min ( quantity, shipmentRow.QuantityPlan );
			shipmentRow.QuantityPkg = Min ( quantityPkg, shipmentRow.QuantityPkgPlan );
			shipmentRow.QuantityBack = shipmentRow.QuantityPlan - shipmentRow.Quantity;
			shipmentRow.QuantityPkgBack = shipmentRow.QuantityPkgPlan - shipmentRow.QuantityPkg;
			quantity = quantity - shipmentRow.Quantity;
			quantityPkg = quantityPkg - shipmentRow.QuantityPkg;
		enddo; 
	enddo; 
	
EndProcedure 

// *****************************************
// *********** Group Form

&AtClient
Procedure StartPicking ( Command )
	
	startCommand ( PredefinedValue ( "Enum.Actions.StartPicking" ) );
	
EndProcedure

&AtClient
Procedure startCommand ( Command )
	
	if ( Command = PredefinedValue ( "Enum.Actions.StartPicking" ) ) then
		Output.StartShippingConfirmation ( ThisObject, Command, , "CommandConfirmation" );
	elsif ( Command = PredefinedValue ( "Enum.Actions.CompletePicking" ) ) then
		Output.CompleteShipmentConfirmation ( ThisObject, Command, , "CommandConfirmation" );
	endif; 
	
EndProcedure

&AtClient
Procedure CommandConfirmation ( Answer, Command ) export
	
	if ( Answer <> DialogReturnCode.Yes ) then
		return;
	endif; 
	if ( Command = PredefinedValue ( "Enum.Actions.StartPicking" ) ) then
		performCommand ( Command, false );
	elsif ( Command = PredefinedValue ( "Enum.Actions.CompletePicking" ) ) then
		performCommand ( Command, true );
	endif;
	
EndProcedure

&AtClient
Procedure performCommand ( Command, CloseForm )
	
	Object.Action = Command;
	if ( Write () ) then
		if ( CloseForm ) then
			Close ();
		endif;
	else
		Output.OperationNotPerformed ();
	endif; 
	
EndProcedure 

&AtClient
Procedure Complete ( Command )
	
	startCommand ( PredefinedValue ( "Enum.Actions.CompletePicking" ) );
	
EndProcedure

// *****************************************
// *********** Table Items

&AtClient
Procedure Scan ( Command )
	
	OpenForm ( "CommonForm.Scan", new Structure ( "JustScan", true ), ThisObject );
	
EndProcedure

&AtClient
Procedure ItemsPickedOnChange ( Item )
	
	pickItem ();
	
EndProcedure

&AtClient
Procedure ItemsBeforeDeleteRow ( Item, Cancel )
	
	Cancel = true;
	
EndProcedure

&AtClient
Procedure ItemsBeforeAddRow ( Item, Cancel, Clone, Parent, Folder, Parameter )
	
	Cancel = true;
	
EndProcedure

&AtClient
Procedure ItemsOnActivateRow ( Item )
	
	ItemsRow = Item.CurrentData;
	
EndProcedure

&AtClient
Procedure ItemsQuantityPkgOnChange ( Item )
	
	Computations.Units ( ItemsRow );
	calcQuantityBack ();
	applyQuantity ();
	
EndProcedure

&AtClient
Procedure ItemsQuantityOnChange ( Item )
	
	Computations.Packages ( ItemsRow );
	calcQuantityBack ();
	applyQuantity ();

EndProcedure

// *****************************************
// *********** Table Items

&AtClient
Procedure ShipmentsOnActivateRow ( Item )
	
	ShipmentsRow = Items.Shipments.CurrentData;
	
EndProcedure

&AtClient
Procedure ShipmentsSelection ( Item, SelectedRow, Field, StandardProcessing )
	
	ShowValue ( , ShipmentsRow.Shipment );
	
EndProcedure
